Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxFlash_cfg_TC38x.c
IFX_CONST IfxFlash_flashSector IfxFlash_pFlashTableLog[IFXFLASH_PFLASH_NUM_LOG_SECTORS] = {
    {0xA0000000, 0xA0003FFF},      //   PF0 S0
    {0xA0004000, 0xA0007FFF},      //	PF0 S1
    {0xA0008000, 0xA000BFFF},      //	PF0 S2
    {0xA000C000, 0xA000FFFF},      //	PF0 S3
    {0xA0010000, 0xA0013FFF},      //	PF0 S4
    {0xA0014000, 0xA0017FFF},      //	PF0 S5
    {0xA0018000, 0xA001BFFF},      //	PF0 S6
    {0xA001C000, 0xA001FFFF},      //	PF0 S7
    {0xA0020000, 0xA0023FFF},      //	PF0 S8
    {0xA0024000, 0xA0027FFF},      //	PF0 S9
    {0xA0028000, 0xA002BFFF},      //	PF0 S10
    {0xA002C000, 0xA002FFFF},      //	PF0 S11
    {0xA0030000, 0xA0033FFF},      //	PF0 S12
    {0xA0034000, 0xA0037FFF},      //	PF0 S13
    {0xA0038000, 0xA003BFFF},      //	PF0 S14
    {0xA003C000, 0xA003FFFF},      //	PF0 S15
    {0xA0040000, 0xA0043FFF},      //	PF0 S16
    {0xA0044000, 0xA0047FFF},      //	PF0 S17
    {0xA0048000, 0xA004BFFF},      //	PF0 S18
    {0xA004C000, 0xA004FFFF},      //	PF0 S19
    {0xA0050000, 0xA0053FFF},      //	PF0 S20
    {0xA0054000, 0xA0057FFF},      //	PF0 S21
    {0xA0058000, 0xA005BFFF},      //	PF0 S22
    {0xA005C000, 0xA005FFFF},      //	PF0 S23
    {0xA0060000, 0xA0063FFF},      //	PF0 S24
    {0xA0064000, 0xA0067FFF},      //	PF0 S25
    {0xA0068000, 0xA006BFFF},      //	PF0 S26
    {0xA006C000, 0xA006FFFF},      //	PF0 S27
    {0xA0070000, 0xA0073FFF},      //	PF0 S28
    {0xA0074000, 0xA0077FFF},      //	PF0 S29
    {0xA0078000, 0xA007BFFF},      //	PF0 S30
    {0xA007C000, 0xA007FFFF},      //	PF0 S31
    {0xA0080000, 0xA0083FFF},      //	PF0 S32
    {0xA0084000, 0xA0087FFF},      //	PF0 S33
    {0xA0088000, 0xA008BFFF},      //	PF0 S34
    {0xA008C000, 0xA008FFFF},      //	PF0 S35
    {0xA0090000, 0xA0093FFF},      //	PF0 S36
    {0xA0094000, 0xA0097FFF},      //	PF0 S37
    {0xA0098000, 0xA009BFFF},      //	PF0 S38
    {0xA009C000, 0xA009FFFF},      //	PF0 S39
    {0xA00A0000, 0xA00A3FFF},      //	PF0 S40
    {0xA00A4000, 0xA00A7FFF},      //	PF0 S41
    {0xA00A8000, 0xA00ABFFF},      //	PF0 S42
    {0xA00AC000, 0xA00AFFFF},      //	PF0 S43
    {0xA00B0000, 0xA00B3FFF},      //	PF0 S44
    {0xA00B4000, 0xA00B7FFF},      //	PF0 S45
    {0xA00B8000, 0xA00BBFFF},      //	PF0 S46
    {0xA00BC000, 0xA00BFFFF},      //	PF0 S47
    {0xA00C0000, 0xA00C3FFF},      //	PF0 S48
    {0xA00C4000, 0xA00C7FFF},      //	PF0 S49
    {0xA00C8000, 0xA00CBFFF},      //	PF0 S50
    {0xA00CC000, 0xA00CFFFF},      //	PF0 S51
    {0xA00D0000, 0xA00D3FFF},      //	PF0 S52
    {0xA00D4000, 0xA00D7FFF},      //	PF0 S53
    {0xA00D8000, 0xA00DBFFF},      //	PF0 S54
    {0xA00DC000, 0xA00DFFFF},      //	PF0 S55
    {0xA00E0000, 0xA00E3FFF},      //	PF0 S56
    {0xA00E4000, 0xA00E7FFF},      //	PF0 S57
    {0xA00E8000, 0xA00EBFFF},      //	PF0 S58
    {0xA00EC000, 0xA00EFFFF},      //	PF0 S59
    {0xA00F0000, 0xA00F3FFF},      //	PF0 S60
    {0xA00F4000, 0xA00F7FFF},      //	PF0 S61
    {0xA00F8000, 0xA00FBFFF},      //	PF0 S62
    {0xA00FC000, 0xA00FFFFF},      //	PF0 S63
    {0xA0100000, 0xA0103FFF},      //	PF0 S64
    {0xA0104000, 0xA0107FFF},      //	PF0 S65
    {0xA0108000, 0xA010BFFF},      //	PF0 S66
    {0xA010C000, 0xA010FFFF},      //	PF0 S67
    {0xA0110000, 0xA0113FFF},      //	PF0 S68
    {0xA0114000, 0xA0117FFF},      //	PF0 S69
    {0xA0118000, 0xA011BFFF},      //	PF0 S70
    {0xA011C000, 0xA011FFFF},      //	PF0 S71
    {0xA0120000, 0xA0123FFF},      //	PF0 S72
    {0xA0124000, 0xA0127FFF},      //	PF0 S73
    {0xA0128000, 0xA012BFFF},      //	PF0 S74
    {0xA012C000, 0xA012FFFF},      //	PF0 S75
    {0xA0130000, 0xA0133FFF},      //	PF0 S76
    {0xA0134000, 0xA0137FFF},      //	PF0 S77
    {0xA0138000, 0xA013BFFF},      //	PF0 S78
    {0xA013C000, 0xA013FFFF},      //	PF0 S79
    {0xA0140000, 0xA0143FFF},      //	PF0 S80
    {0xA0144000, 0xA0147FFF},      //	PF0 S81
    {0xA0148000, 0xA014BFFF},      //	PF0 S82
    {0xA014C000, 0xA014FFFF},      //	PF0 S83
    {0xA0150000, 0xA0153FFF},      //	PF0 S84
    {0xA0154000, 0xA0157FFF},      //	PF0 S85
    {0xA0158000, 0xA015BFFF},      //	PF0 S86
    {0xA015C000, 0xA015FFFF},      //	PF0 S87
    {0xA0160000, 0xA0163FFF},      //	PF0 S88
    {0xA0164000, 0xA0167FFF},      //	PF0 S89
    {0xA0168000, 0xA016BFFF},      //	PF0 S90
    {0xA016C000, 0xA016FFFF},      //	PF0 S91
    {0xA0170000, 0xA0173FFF},      //	PF0 S92
    {0xA0174000, 0xA0177FFF},      //	PF0 S93
    {0xA0178000, 0xA017BFFF},      //	PF0 S94
    {0xA017C000, 0xA017FFFF},      //	PF0 S95
    {0xA0180000, 0xA0183FFF},      //	PF0 S96
    {0xA0184000, 0xA0187FFF},      //	PF0 S97
    {0xA0188000, 0xA018BFFF},      //	PF0 S98
    {0xA018C000, 0xA018FFFF},      //	PF0 S99
    {0xA0190000, 0xA0193FFF},      //	PF0 S100
    {0xA0194000, 0xA0197FFF},      //	PF0 S101
    {0xA0198000, 0xA019BFFF},      //	PF0 S102
    {0xA019C000, 0xA019FFFF},      //	PF0 S103
    {0xA01A0000, 0xA01A3FFF},      //	PF0 S104
    {0xA01A4000, 0xA01A7FFF},      //	PF0 S105
    {0xA01A8000, 0xA01ABFFF},      //	PF0 S106
    {0xA01AC000, 0xA01AFFFF},      //	PF0 S107
    {0xA01B0000, 0xA01B3FFF},      //	PF0 S108
    {0xA01B4000, 0xA01B7FFF},      //	PF0 S109
    {0xA01B8000, 0xA01BBFFF},      //	PF0 S110
    {0xA01BC000, 0xA01BFFFF},      //	PF0 S111
    {0xA01C0000, 0xA01C3FFF},      //	PF0 S112
    {0xA01C4000, 0xA01C7FFF},      //	PF0 S113
    {0xA01C8000, 0xA01CBFFF},      //	PF0 S114
    {0xA01CC000, 0xA01CFFFF},      //	PF0 S115
    {0xA01D0000, 0xA01D3FFF},      //	PF0 S116
    {0xA01D4000, 0xA01D7FFF},      //	PF0 S117
    {0xA01D8000, 0xA01DBFFF},      //	PF0 S118
    {0xA01DC000, 0xA01DFFFF},      //	PF0 S119
    {0xA01E0000, 0xA01E3FFF},      //	PF0 S120
    {0xA01E4000, 0xA01E7FFF},      //	PF0 S121
    {0xA01E8000, 0xA01EBFFF},      //	PF0 S122
    {0xA01EC000, 0xA01EFFFF},      //	PF0 S123
    {0xA01F0000, 0xA01F3FFF},      //	PF0 S124
    {0xA01F4000, 0xA01F7FFF},      //	PF0 S125
    {0xA01F8000, 0xA01FBFFF},      //	PF0 S126
    {0xA01FC000, 0xA01FFFFF},      //	PF0 S127
    {0xA0200000, 0xA0203FFF},      //	PF0 S128
    {0xA0204000, 0xA0207FFF},      //	PF0 S129
    {0xA0208000, 0xA020BFFF},      //	PF0 S130
    {0xA020C000, 0xA020FFFF},      //	PF0 S131
    {0xA0210000, 0xA0213FFF},      //	PF0 S132
    {0xA0214000, 0xA0217FFF},      //	PF0 S133
    {0xA0218000, 0xA021BFFF},      //	PF0 S134
    {0xA021C000, 0xA021FFFF},      //	PF0 S135
    {0xA0220000, 0xA0223FFF},      //	PF0 S136
    {0xA0224000, 0xA0227FFF},      //	PF0 S137
    {0xA0228000, 0xA022BFFF},      //	PF0 S138
    {0xA022C000, 0xA022FFFF},      //	PF0 S139
    {0xA0230000, 0xA0233FFF},      //	PF0 S140
    {0xA0234000, 0xA0237FFF},      //	PF0 S141
    {0xA0238000, 0xA023BFFF},      //	PF0 S142
    {0xA023C000, 0xA023FFFF},      //	PF0 S143
    {0xA0240000, 0xA0243FFF},      //	PF0 S144
    {0xA0244000, 0xA0247FFF},      //	PF0 S145
    {0xA0248000, 0xA024BFFF},      //	PF0 S146
    {0xA024C000, 0xA024FFFF},      //	PF0 S147
    {0xA0250000, 0xA0253FFF},      //	PF0 S148
    {0xA0254000, 0xA0257FFF},      //	PF0 S149
    {0xA0258000, 0xA025BFFF},      //	PF0 S150
    {0xA025C000, 0xA025FFFF},      //	PF0 S151
    {0xA0260000, 0xA0263FFF},      //	PF0 S152
    {0xA0264000, 0xA0267FFF},      //	PF0 S153
    {0xA0268000, 0xA026BFFF},      //	PF0 S154
    {0xA026C000, 0xA026FFFF},      //	PF0 S155
    {0xA0270000, 0xA0273FFF},      //	PF0 S156
    {0xA0274000, 0xA0277FFF},      //	PF0 S157
    {0xA0278000, 0xA027BFFF},      //	PF0 S158
    {0xA027C000, 0xA027FFFF},      //	PF0 S159
    {0xA0280000, 0xA0283FFF},      //	PF0 S160
    {0xA0284000, 0xA0287FFF},      //	PF0 S161
    {0xA0288000, 0xA028BFFF},      //	PF0 S162
    {0xA028C000, 0xA028FFFF},      //	PF0 S163
    {0xA0290000, 0xA0293FFF},      //	PF0 S164
    {0xA0294000, 0xA0297FFF},      //	PF0 S165
    {0xA0298000, 0xA029BFFF},      //	PF0 S166
    {0xA029C000, 0xA029FFFF},      //	PF0 S167
    {0xA02A0000, 0xA02A3FFF},      //	PF0 S168
    {0xA02A4000, 0xA02A7FFF},      //	PF0 S169
    {0xA02A8000, 0xA02ABFFF},      //	PF0 S170
    {0xA02AC000, 0xA02AFFFF},      //	PF0 S171
    {0xA02B0000, 0xA02B3FFF},      //	PF0 S172
    {0xA02B4000, 0xA02B7FFF},      //	PF0 S173
    {0xA02B8000, 0xA02BBFFF},      //	PF0 S174
    {0xA02BC000, 0xA02BFFFF},      //	PF0 S175
    {0xA02C0000, 0xA02C3FFF},      //	PF0 S176
    {0xA02C4000, 0xA02C7FFF},      //	PF0 S177
    {0xA02C8000, 0xA02CBFFF},      //	PF0 S178
    {0xA02CC000, 0xA02CFFFF},      //	PF0 S179
    {0xA02D0000, 0xA02D3FFF},      //	PF0 S180
    {0xA02D4000, 0xA02D7FFF},      //	PF0 S181
    {0xA02D8000, 0xA02DBFFF},      //	PF0 S182
    {0xA02DC000, 0xA02DFFFF},      //	PF0 S183
    {0xA02E0000, 0xA02E3FFF},      //	PF0 S184
    {0xA02E4000, 0xA02E7FFF},      //	PF0 S185
    {0xA02E8000, 0xA02EBFFF},      //	PF0 S186
    {0xA02EC000, 0xA02EFFFF},      //	PF0 S187
    {0xA02F0000, 0xA02F3FFF},      //	PF0 S188
    {0xA02F4000, 0xA02F7FFF},      //	PF0 S189
    {0xA02F8000, 0xA02FBFFF},      //	PF0 S190
    {0xA02FC000, 0xA02FFFFF},      //	PF0 S191
    {0xA0300000, 0xA0303FFF},      //	PF1 S0
    {0xA0304000, 0xA0307FFF},      //	PF1 S1
    {0xA0308000, 0xA030BFFF},      //	PF1 S2
    {0xA030C000, 0xA030FFFF},      //	PF1 S3
    {0xA0310000, 0xA0313FFF},      //	PF1 S4
    {0xA0314000, 0xA0317FFF},      //	PF1 S5
    {0xA0318000, 0xA031BFFF},      //	PF1 S6
    {0xA031C000, 0xA031FFFF},      //	PF1 S7
    {0xA0320000, 0xA0323FFF},      //	PF1 S8
    {0xA0324000, 0xA0327FFF},      //	PF1 S9
    {0xA0328000, 0xA032BFFF},      //	PF1 S10
    {0xA032C000, 0xA032FFFF},      //	PF1 S11
    {0xA0330000, 0xA0333FFF},      //	PF1 S12
    {0xA0334000, 0xA0337FFF},      //	PF1 S13
    {0xA0338000, 0xA033BFFF},      //	PF1 S14
    {0xA033C000, 0xA033FFFF},      //	PF1 S15
    {0xA0340000, 0xA0343FFF},      //	PF1 S16
    {0xA0344000, 0xA0347FFF},      //	PF1 S17
    {0xA0348000, 0xA034BFFF},      //	PF1 S18
    {0xA034C000, 0xA034FFFF},      //	PF1 S19
    {0xA0350000, 0xA0353FFF},      //	PF1 S20
    {0xA0354000, 0xA0357FFF},      //	PF1 S21
    {0xA0358000, 0xA035BFFF},      //	PF1 S22
    {0xA035C000, 0xA035FFFF},      //	PF1 S23
    {0xA0360000, 0xA0363FFF},      //	PF1 S24
    {0xA0364000, 0xA0367FFF},      //	PF1 S25
    {0xA0368000, 0xA036BFFF},      //	PF1 S26
    {0xA036C000, 0xA036FFFF},      //	PF1 S27
    {0xA0370000, 0xA0373FFF},      //	PF1 S28
    {0xA0374000, 0xA0377FFF},      //	PF1 S29
    {0xA0378000, 0xA037BFFF},      //	PF1 S30
    {0xA037C000, 0xA037FFFF},      //	PF1 S31
    {0xA0380000, 0xA0383FFF},      //	PF1 S32
    {0xA0384000, 0xA0387FFF},      //	PF1 S33
    {0xA0388000, 0xA038BFFF},      //	PF1 S34
    {0xA038C000, 0xA038FFFF},      //	PF1 S35
    {0xA0390000, 0xA0393FFF},      //	PF1 S36
    {0xA0394000, 0xA0397FFF},      //	PF1 S37
    {0xA0398000, 0xA039BFFF},      //	PF1 S38
    {0xA039C000, 0xA039FFFF},      //	PF1 S39
    {0xA03A0000, 0xA03A3FFF},      //	PF1 S40
    {0xA03A4000, 0xA03A7FFF},      //	PF1 S41
    {0xA03A8000, 0xA03ABFFF},      //	PF1 S42
    {0xA03AC000, 0xA03AFFFF},      //	PF1 S43
    {0xA03B0000, 0xA03B3FFF},      //	PF1 S44
    {0xA03B4000, 0xA03B7FFF},      //	PF1 S45
    {0xA03B8000, 0xA03BBFFF},      //	PF1 S46
    {0xA03BC000, 0xA03BFFFF},      //	PF1 S47
    {0xA03C0000, 0xA03C3FFF},      //	PF1 S48
    {0xA03C4000, 0xA03C7FFF},      //	PF1 S49
    {0xA03C8000, 0xA03CBFFF},      //	PF1 S50
    {0xA03CC000, 0xA03CFFFF},      //	PF1 S51
    {0xA03D0000, 0xA03D3FFF},      //	PF1 S52
    {0xA03D4000, 0xA03D7FFF},      //	PF1 S53
    {0xA03D8000, 0xA03DBFFF},      //	PF1 S54
    {0xA03DC000, 0xA03DFFFF},      //	PF1 S55
    {0xA03E0000, 0xA03E3FFF},      //	PF1 S56
    {0xA03E4000, 0xA03E7FFF},      //	PF1 S57
    {0xA03E8000, 0xA03EBFFF},      //	PF1 S58
    {0xA03EC000, 0xA03EFFFF},      //	PF1 S59
    {0xA03F0000, 0xA03F3FFF},      //	PF1 S60
    {0xA03F4000, 0xA03F7FFF},      //	PF1 S61
    {0xA03F8000, 0xA03FBFFF},      //	PF1 S62
    {0xA03FC000, 0xA03FFFFF},      //	PF1 S63
    {0xA0400000, 0xA0403FFF},      //	PF1 S64
    {0xA0404000, 0xA0407FFF},      //	PF1 S65
    {0xA0408000, 0xA040BFFF},      //	PF1 S66
    {0xA040C000, 0xA040FFFF},      //	PF1 S67
    {0xA0410000, 0xA0413FFF},      //	PF1 S68
    {0xA0414000, 0xA0417FFF},      //	PF1 S69
    {0xA0418000, 0xA041BFFF},      //	PF1 S70
    {0xA041C000, 0xA041FFFF},      //	PF1 S71
    {0xA0420000, 0xA0423FFF},      //	PF1 S72
    {0xA0424000, 0xA0427FFF},      //	PF1 S73
    {0xA0428000, 0xA042BFFF},      //	PF1 S74
    {0xA042C000, 0xA042FFFF},      //	PF1 S75
    {0xA0430000, 0xA0433FFF},      //	PF1 S76
    {0xA0434000, 0xA0437FFF},      //	PF1 S77
    {0xA0438000, 0xA043BFFF},      //	PF1 S78
    {0xA043C000, 0xA043FFFF},      //	PF1 S79
    {0xA0440000, 0xA0443FFF},      //	PF1 S80
    {0xA0444000, 0xA0447FFF},      //	PF1 S81
    {0xA0448000, 0xA044BFFF},      //	PF1 S82
    {0xA044C000, 0xA044FFFF},      //	PF1 S83
    {0xA0450000, 0xA0453FFF},      //	PF1 S84
    {0xA0454000, 0xA0457FFF},      //	PF1 S85
    {0xA0458000, 0xA045BFFF},      //	PF1 S86
    {0xA045C000, 0xA045FFFF},      //	PF1 S87
    {0xA0460000, 0xA0463FFF},      //	PF1 S88
    {0xA0464000, 0xA0467FFF},      //	PF1 S89
    {0xA0468000, 0xA046BFFF},      //	PF1 S90
    {0xA046C000, 0xA046FFFF},      //	PF1 S91
    {0xA0470000, 0xA0473FFF},      //	PF1 S92
    {0xA0474000, 0xA0477FFF},      //	PF1 S93
    {0xA0478000, 0xA047BFFF},      //	PF1 S94
    {0xA047C000, 0xA047FFFF},      //	PF1 S95
    {0xA0480000, 0xA0483FFF},      //	PF1 S96
    {0xA0484000, 0xA0487FFF},      //	PF1 S97
    {0xA0488000, 0xA048BFFF},      //	PF1 S98
    {0xA048C000, 0xA048FFFF},      //	PF1 S99
    {0xA0490000, 0xA0493FFF},      //	PF1 S100
    {0xA0494000, 0xA0497FFF},      //	PF1 S101
    {0xA0498000, 0xA049BFFF},      //	PF1 S102
    {0xA049C000, 0xA049FFFF},      //	PF1 S103
    {0xA04A0000, 0xA04A3FFF},      //	PF1 S104
    {0xA04A4000, 0xA04A7FFF},      //	PF1 S105
    {0xA04A8000, 0xA04ABFFF},      //	PF1 S106
    {0xA04AC000, 0xA04AFFFF},      //	PF1 S107
    {0xA04B0000, 0xA04B3FFF},      //	PF1 S108
    {0xA04B4000, 0xA04B7FFF},      //	PF1 S109
    {0xA04B8000, 0xA04BBFFF},      //	PF1 S110
    {0xA04BC000, 0xA04BFFFF},      //	PF1 S111
    {0xA04C0000, 0xA04C3FFF},      //	PF1 S112
    {0xA04C4000, 0xA04C7FFF},      //	PF1 S113
    {0xA04C8000, 0xA04CBFFF},      //	PF1 S114
    {0xA04CC000, 0xA04CFFFF},      //	PF1 S115
    {0xA04D0000, 0xA04D3FFF},      //	PF1 S116
    {0xA04D4000, 0xA04D7FFF},      //	PF1 S117
    {0xA04D8000, 0xA04DBFFF},      //	PF1 S118
    {0xA04DC000, 0xA04DFFFF},      //	PF1 S119
    {0xA04E0000, 0xA04E3FFF},      //	PF1 S120
    {0xA04E4000, 0xA04E7FFF},      //	PF1 S121
    {0xA04E8000, 0xA04EBFFF},      //	PF1 S122
    {0xA04EC000, 0xA04EFFFF},      //	PF1 S123
    {0xA04F0000, 0xA04F3FFF},      //	PF1 S124
    {0xA04F4000, 0xA04F7FFF},      //	PF1 S125
    {0xA04F8000, 0xA04FBFFF},      //	PF1 S126
    {0xA04FC000, 0xA04FFFFF},      //	PF1 S127
    {0xA0500000, 0xA0503FFF},      //	PF1 S128
    {0xA0504000, 0xA0507FFF},      //	PF1 S129
    {0xA0508000, 0xA050BFFF},      //	PF1 S130
    {0xA050C000, 0xA050FFFF},      //	PF1 S131
    {0xA0510000, 0xA0513FFF},      //	PF1 S132
    {0xA0514000, 0xA0517FFF},      //	PF1 S133
    {0xA0518000, 0xA051BFFF},      //	PF1 S134
    {0xA051C000, 0xA051FFFF},      //	PF1 S135
    {0xA0520000, 0xA0523FFF},      //	PF1 S136
    {0xA0524000, 0xA0527FFF},      //	PF1 S137
    {0xA0528000, 0xA052BFFF},      //	PF1 S138
    {0xA052C000, 0xA052FFFF},      //	PF1 S139
    {0xA0530000, 0xA0533FFF},      //	PF1 S140
    {0xA0534000, 0xA0537FFF},      //	PF1 S141
    {0xA0538000, 0xA053BFFF},      //	PF1 S142
    {0xA053C000, 0xA053FFFF},      //	PF1 S143
    {0xA0540000, 0xA0543FFF},      //	PF1 S144
    {0xA0544000, 0xA0547FFF},      //	PF1 S145
    {0xA0548000, 0xA054BFFF},      //	PF1 S146
    {0xA054C000, 0xA054FFFF},      //	PF1 S147
    {0xA0550000, 0xA0553FFF},      //	PF1 S148
    {0xA0554000, 0xA0557FFF},      //	PF1 S149
    {0xA0558000, 0xA055BFFF},      //	PF1 S150
    {0xA055C000, 0xA055FFFF},      //	PF1 S151
    {0xA0560000, 0xA0563FFF},      //	PF1 S152
    {0xA0564000, 0xA0567FFF},      //	PF1 S153
    {0xA0568000, 0xA056BFFF},      //	PF1 S154
    {0xA056C000, 0xA056FFFF},      //	PF1 S155
    {0xA0570000, 0xA0573FFF},      //	PF1 S156
    {0xA0574000, 0xA0577FFF},      //	PF1 S157
    {0xA0578000, 0xA057BFFF},      //	PF1 S158
    {0xA057C000, 0xA057FFFF},      //	PF1 S159
    {0xA0580000, 0xA0583FFF},      //	PF1 S160
    {0xA0584000, 0xA0587FFF},      //	PF1 S161
    {0xA0588000, 0xA058BFFF},      //	PF1 S162
    {0xA058C000, 0xA058FFFF},      //	PF1 S163
    {0xA0590000, 0xA0593FFF},      //	PF1 S164
    {0xA0594000, 0xA0597FFF},      //	PF1 S165
    {0xA0598000, 0xA059BFFF},      //	PF1 S166
    {0xA059C000, 0xA059FFFF},      //	PF1 S167
    {0xA05A0000, 0xA05A3FFF},      //	PF1 S168
    {0xA05A4000, 0xA05A7FFF},      //	PF1 S169
    {0xA05A8000, 0xA05ABFFF},      //	PF1 S170
    {0xA05AC000, 0xA05AFFFF},      //	PF1 S171
    {0xA05B0000, 0xA05B3FFF},      //	PF1 S172
    {0xA05B4000, 0xA05B7FFF},      //	PF1 S173
    {0xA05B8000, 0xA05BBFFF},      //	PF1 S174
    {0xA05BC000, 0xA05BFFFF},      //	PF1 S175
    {0xA05C0000, 0xA05C3FFF},      //	PF1 S176
    {0xA05C4000, 0xA05C7FFF},      //	PF1 S177
    {0xA05C8000, 0xA05CBFFF},      //	PF1 S178
    {0xA05CC000, 0xA05CFFFF},      //	PF1 S179
    {0xA05D0000, 0xA05D3FFF},      //	PF1 S180
    {0xA05D4000, 0xA05D7FFF},      //	PF1 S181
    {0xA05D8000, 0xA05DBFFF},      //	PF1 S182
    {0xA05DC000, 0xA05DFFFF},      //	PF1 S183
    {0xA05E0000, 0xA05E3FFF},      //	PF1 S184
    {0xA05E4000, 0xA05E7FFF},      //	PF1 S185
    {0xA05E8000, 0xA05EBFFF},      //	PF1 S186
    {0xA05EC000, 0xA05EFFFF},      //	PF1 S187
    {0xA05F0000, 0xA05F3FFF},      //	PF1 S188
    {0xA05F4000, 0xA05F7FFF},      //	PF1 S189
    {0xA05F8000, 0xA05FBFFF},      //	PF1 S190
    {0xA05FC000, 0xA05FFFFF},      //	PF1 S191
    {0xA0600000, 0xA0603FFF},      //	PF2 S0
    {0xA0604000, 0xA0607FFF},      //	PF2 S1
    {0xA0608000, 0xA060BFFF},      //	PF2 S2
    {0xA060C000, 0xA060FFFF},      //	PF2 S3
    {0xA0610000, 0xA0613FFF},      //	PF2 S4
    {0xA0614000, 0xA0617FFF},      //	PF2 S5
    {0xA0618000, 0xA061BFFF},      //	PF2 S6
    {0xA061C000, 0xA061FFFF},      //	PF2 S7
    {0xA0620000, 0xA0623FFF},      //	PF2 S8
    {0xA0624000, 0xA0627FFF},      //	PF2 S9
    {0xA0628000, 0xA062BFFF},      //	PF2 S10
    {0xA062C000, 0xA062FFFF},      //	PF2 S11
    {0xA0630000, 0xA0633FFF},      //	PF2 S12
    {0xA0634000, 0xA0637FFF},      //	PF2 S13
    {0xA0638000, 0xA063BFFF},      //	PF2 S14
    {0xA063C000, 0xA063FFFF},      //	PF2 S15
    {0xA0640000, 0xA0643FFF},      //	PF2 S16
    {0xA0644000, 0xA0647FFF},      //	PF2 S17
    {0xA0648000, 0xA064BFFF},      //	PF2 S18
    {0xA064C000, 0xA064FFFF},      //	PF2 S19
    {0xA0650000, 0xA0653FFF},      //	PF2 S20
    {0xA0654000, 0xA0657FFF},      //	PF2 S21
    {0xA0658000, 0xA065BFFF},      //	PF2 S22
    {0xA065C000, 0xA065FFFF},      //	PF2 S23
    {0xA0660000, 0xA0663FFF},      //	PF2 S24
    {0xA0664000, 0xA0667FFF},      //	PF2 S25
    {0xA0668000, 0xA066BFFF},      //	PF2 S26
    {0xA066C000, 0xA066FFFF},      //	PF2 S27
    {0xA0670000, 0xA0673FFF},      //	PF2 S28
    {0xA0674000, 0xA0677FFF},      //	PF2 S29
    {0xA0678000, 0xA067BFFF},      //	PF2 S30
    {0xA067C000, 0xA067FFFF},      //	PF2 S31
    {0xA0680000, 0xA0683FFF},      //	PF2 S32
    {0xA0684000, 0xA0687FFF},      //	PF2 S33
    {0xA0688000, 0xA068BFFF},      //	PF2 S34
    {0xA068C000, 0xA068FFFF},      //	PF2 S35
    {0xA0690000, 0xA0693FFF},      //	PF2 S36
    {0xA0694000, 0xA0697FFF},      //	PF2 S37
    {0xA0698000, 0xA069BFFF},      //	PF2 S38
    {0xA069C000, 0xA069FFFF},      //	PF2 S39
    {0xA06A0000, 0xA06A3FFF},      //	PF2 S40
    {0xA06A4000, 0xA06A7FFF},      //	PF2 S41
    {0xA06A8000, 0xA06ABFFF},      //	PF2 S42
    {0xA06AC000, 0xA06AFFFF},      //	PF2 S43
    {0xA06B0000, 0xA06B3FFF},      //	PF2 S44
    {0xA06B4000, 0xA06B7FFF},      //	PF2 S45
    {0xA06B8000, 0xA06BBFFF},      //	PF2 S46
    {0xA06BC000, 0xA06BFFFF},      //	PF2 S47
    {0xA06C0000, 0xA06C3FFF},      //	PF2 S48
    {0xA06C4000, 0xA06C7FFF},      //	PF2 S49
    {0xA06C8000, 0xA06CBFFF},      //	PF2 S50
    {0xA06CC000, 0xA06CFFFF},      //	PF2 S51
    {0xA06D0000, 0xA06D3FFF},      //	PF2 S52
    {0xA06D4000, 0xA06D7FFF},      //	PF2 S53
    {0xA06D8000, 0xA06DBFFF},      //	PF2 S54
    {0xA06DC000, 0xA06DFFFF},      //	PF2 S55
    {0xA06E0000, 0xA06E3FFF},      //	PF2 S56
    {0xA06E4000, 0xA06E7FFF},      //	PF2 S57
    {0xA06E8000, 0xA06EBFFF},      //	PF2 S58
    {0xA06EC000, 0xA06EFFFF},      //	PF2 S59
    {0xA06F0000, 0xA06F3FFF},      //	PF2 S60
    {0xA06F4000, 0xA06F7FFF},      //	PF2 S61
    {0xA06F8000, 0xA06FBFFF},      //	PF2 S62
    {0xA06FC000, 0xA06FFFFF},      //	PF2 S63
    {0xA0700000, 0xA0703FFF},      //	PF2 S64
    {0xA0704000, 0xA0707FFF},      //	PF2 S65
    {0xA0708000, 0xA070BFFF},      //	PF2 S66
    {0xA070C000, 0xA070FFFF},      //	PF2 S67
    {0xA0710000, 0xA0713FFF},      //	PF2 S68
    {0xA0714000, 0xA0717FFF},      //	PF2 S69
    {0xA0718000, 0xA071BFFF},      //	PF2 S70
    {0xA071C000, 0xA071FFFF},      //	PF2 S71
    {0xA0720000, 0xA0723FFF},      //	PF2 S72
    {0xA0724000, 0xA0727FFF},      //	PF2 S73
    {0xA0728000, 0xA072BFFF},      //	PF2 S74
    {0xA072C000, 0xA072FFFF},      //	PF2 S75
    {0xA0730000, 0xA0733FFF},      //	PF2 S76
    {0xA0734000, 0xA0737FFF},      //	PF2 S77
    {0xA0738000, 0xA073BFFF},      //	PF2 S78
    {0xA073C000, 0xA073FFFF},      //	PF2 S79
    {0xA0740000, 0xA0743FFF},      //	PF2 S80
    {0xA0744000, 0xA0747FFF},      //	PF2 S81
    {0xA0748000, 0xA074BFFF},      //	PF2 S82
    {0xA074C000, 0xA074FFFF},      //	PF2 S83
    {0xA0750000, 0xA0753FFF},      //	PF2 S84
    {0xA0754000, 0xA0757FFF},      //	PF2 S85
    {0xA0758000, 0xA075BFFF},      //	PF2 S86
    {0xA075C000, 0xA075FFFF},      //	PF2 S87
    {0xA0760000, 0xA0763FFF},      //	PF2 S88
    {0xA0764000, 0xA0767FFF},      //	PF2 S89
    {0xA0768000, 0xA076BFFF},      //	PF2 S90
    {0xA076C000, 0xA076FFFF},      //	PF2 S91
    {0xA0770000, 0xA0773FFF},      //	PF2 S92
    {0xA0774000, 0xA0777FFF},      //	PF2 S93
    {0xA0778000, 0xA077BFFF},      //	PF2 S94
    {0xA077C000, 0xA077FFFF},      //	PF2 S95
    {0xA0780000, 0xA0783FFF},      //	PF2 S96
    {0xA0784000, 0xA0787FFF},      //	PF2 S97
    {0xA0788000, 0xA078BFFF},      //	PF2 S98
    {0xA078C000, 0xA078FFFF},      //	PF2 S99
    {0xA0790000, 0xA0793FFF},      //	PF2 S100
    {0xA0794000, 0xA0797FFF},      //	PF2 S101
    {0xA0798000, 0xA079BFFF},      //	PF2 S102
    {0xA079C000, 0xA079FFFF},      //	PF2 S103
    {0xA07A0000, 0xA07A3FFF},      //	PF2 S104
    {0xA07A4000, 0xA07A7FFF},      //	PF2 S105
    {0xA07A8000, 0xA07ABFFF},      //	PF2 S106
    {0xA07AC000, 0xA07AFFFF},      //	PF2 S107
    {0xA07B0000, 0xA07B3FFF},      //	PF2 S108
    {0xA07B4000, 0xA07B7FFF},      //	PF2 S109
    {0xA07B8000, 0xA07BBFFF},      //	PF2 S110
    {0xA07BC000, 0xA07BFFFF},      //	PF2 S111
    {0xA07C0000, 0xA07C3FFF},      //	PF2 S112
    {0xA07C4000, 0xA07C7FFF},      //	PF2 S113
    {0xA07C8000, 0xA07CBFFF},      //	PF2 S114
    {0xA07CC000, 0xA07CFFFF},      //	PF2 S115
    {0xA07D0000, 0xA07D3FFF},      //	PF2 S116
    {0xA07D4000, 0xA07D7FFF},      //	PF2 S117
    {0xA07D8000, 0xA07DBFFF},      //	PF2 S118
    {0xA07DC000, 0xA07DFFFF},      //	PF2 S119
    {0xA07E0000, 0xA07E3FFF},      //	PF2 S120
    {0xA07E4000, 0xA07E7FFF},      //	PF2 S121
    {0xA07E8000, 0xA07EBFFF},      //	PF2 S122
    {0xA07EC000, 0xA07EFFFF},      //	PF2 S123
    {0xA07F0000, 0xA07F3FFF},      //	PF2 S124
    {0xA07F4000, 0xA07F7FFF},      //	PF2 S125
    {0xA07F8000, 0xA07FBFFF},      //	PF2 S126
    {0xA07FC000, 0xA07FFFFF},      //	PF2 S127
    {0xA0800000, 0xA0803FFF},      //	PF2 S128
    {0xA0804000, 0xA0807FFF},      //	PF2 S129
    {0xA0808000, 0xA080BFFF},      //	PF2 S130
