Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxFlash_cfg_TC38x.c
    {0xA080C000, 0xA080FFFF},      //	PF2 S131
    {0xA0810000, 0xA0813FFF},      //	PF2 S132
    {0xA0814000, 0xA0817FFF},      //	PF2 S133
    {0xA0818000, 0xA081BFFF},      //	PF2 S134
    {0xA081C000, 0xA081FFFF},      //	PF2 S135
    {0xA0820000, 0xA0823FFF},      //	PF2 S136
    {0xA0824000, 0xA0827FFF},      //	PF2 S137
    {0xA0828000, 0xA082BFFF},      //	PF2 S138
    {0xA082C000, 0xA082FFFF},      //	PF2 S139
    {0xA0830000, 0xA0833FFF},      //	PF2 S140
    {0xA0834000, 0xA0837FFF},      //	PF2 S141
    {0xA0838000, 0xA083BFFF},      //	PF2 S142
    {0xA083C000, 0xA083FFFF},      //	PF2 S143
    {0xA0840000, 0xA0843FFF},      //	PF2 S144
    {0xA0844000, 0xA0847FFF},      //	PF2 S145
    {0xA0848000, 0xA084BFFF},      //	PF2 S146
    {0xA084C000, 0xA084FFFF},      //	PF2 S147
    {0xA0850000, 0xA0853FFF},      //	PF2 S148
    {0xA0854000, 0xA0857FFF},      //	PF2 S149
    {0xA0858000, 0xA085BFFF},      //	PF2 S150
    {0xA085C000, 0xA085FFFF},      //	PF2 S151
    {0xA0860000, 0xA0863FFF},      //	PF2 S152
    {0xA0864000, 0xA0867FFF},      //	PF2 S153
    {0xA0868000, 0xA086BFFF},      //	PF2 S154
    {0xA086C000, 0xA086FFFF},      //	PF2 S155
    {0xA0870000, 0xA0873FFF},      //	PF2 S156
    {0xA0874000, 0xA0877FFF},      //	PF2 S157
    {0xA0878000, 0xA087BFFF},      //	PF2 S158
    {0xA087C000, 0xA087FFFF},      //	PF2 S159
    {0xA0880000, 0xA0883FFF},      //	PF2 S160
    {0xA0884000, 0xA0887FFF},      //	PF2 S161
    {0xA0888000, 0xA088BFFF},      //	PF2 S162
    {0xA088C000, 0xA088FFFF},      //	PF2 S163
    {0xA0890000, 0xA0893FFF},      //	PF2 S164
    {0xA0894000, 0xA0897FFF},      //	PF2 S165
    {0xA0898000, 0xA089BFFF},      //	PF2 S166
    {0xA089C000, 0xA089FFFF},      //	PF2 S167
    {0xA08A0000, 0xA08A3FFF},      //	PF2 S168
    {0xA08A4000, 0xA08A7FFF},      //	PF2 S169
    {0xA08A8000, 0xA08ABFFF},      //	PF2 S170
    {0xA08AC000, 0xA08AFFFF},      //	PF2 S171
    {0xA08B0000, 0xA08B3FFF},      //	PF2 S172
    {0xA08B4000, 0xA08B7FFF},      //	PF2 S173
    {0xA08B8000, 0xA08BBFFF},      //	PF2 S174
    {0xA08BC000, 0xA08BFFFF},      //	PF2 S175
    {0xA08C0000, 0xA08C3FFF},      //	PF2 S176
    {0xA08C4000, 0xA08C7FFF},      //	PF2 S177
    {0xA08C8000, 0xA08CBFFF},      //	PF2 S178
    {0xA08CC000, 0xA08CFFFF},      //	PF2 S179
    {0xA08D0000, 0xA08D3FFF},      //	PF2 S180
    {0xA08D4000, 0xA08D7FFF},      //	PF2 S181
    {0xA08D8000, 0xA08DBFFF},      //	PF2 S182
    {0xA08DC000, 0xA08DFFFF},      //	PF2 S183
    {0xA08E0000, 0xA08E3FFF},      //	PF2 S184
    {0xA08E4000, 0xA08E7FFF},      //	PF2 S185
    {0xA08E8000, 0xA08EBFFF},      //	PF2 S186
    {0xA08EC000, 0xA08EFFFF},      //	PF2 S187
    {0xA08F0000, 0xA08F3FFF},      //	PF2 S188
    {0xA08F4000, 0xA08F7FFF},      //	PF2 S189
    {0xA08F8000, 0xA08FBFFF},      //	PF2 S190
    {0xA08FC000, 0xA08FFFFF},      //	PF2 S191
    {0xA0900000, 0xA0903FFF},      //	PF3 S0
    {0xA0904000, 0xA0907FFF},      //	PF3 S1
    {0xA0908000, 0xA090BFFF},      //	PF3 S2
    {0xA090C000, 0xA090FFFF},      //	PF3 S3
    {0xA0910000, 0xA0913FFF},      //	PF3 S4
    {0xA0914000, 0xA0917FFF},      //	PF3 S5
    {0xA0918000, 0xA091BFFF},      //	PF3 S6
    {0xA091C000, 0xA091FFFF},      //	PF3 S7
    {0xA0920000, 0xA0923FFF},      //	PF3 S8
    {0xA0924000, 0xA0927FFF},      //	PF3 S9
    {0xA0928000, 0xA092BFFF},      //	PF3 S10
    {0xA092C000, 0xA092FFFF},      //	PF3 S11
    {0xA0930000, 0xA0933FFF},      //	PF3 S12
    {0xA0934000, 0xA0937FFF},      //	PF3 S13
    {0xA0938000, 0xA093BFFF},      //	PF3 S14
    {0xA093C000, 0xA093FFFF},      //	PF3 S15
    {0xA0940000, 0xA0943FFF},      //	PF3 S16
    {0xA0944000, 0xA0947FFF},      //	PF3 S17
    {0xA0948000, 0xA094BFFF},      //	PF3 S18
    {0xA094C000, 0xA094FFFF},      //	PF3 S19
    {0xA0950000, 0xA0953FFF},      //	PF3 S20
    {0xA0954000, 0xA0957FFF},      //	PF3 S21
    {0xA0958000, 0xA095BFFF},      //	PF3 S22
    {0xA095C000, 0xA095FFFF},      //	PF3 S23
    {0xA0960000, 0xA0963FFF},      //	PF3 S24
    {0xA0964000, 0xA0967FFF},      //	PF3 S25
    {0xA0968000, 0xA096BFFF},      //	PF3 S26
    {0xA096C000, 0xA096FFFF},      //	PF3 S27
    {0xA0970000, 0xA0973FFF},      //	PF3 S28
    {0xA0974000, 0xA0977FFF},      //	PF3 S29
    {0xA0978000, 0xA097BFFF},      //	PF3 S30
    {0xA097C000, 0xA097FFFF},      //	PF3 S31
    {0xA0980000, 0xA0983FFF},      //	PF3 S32
    {0xA0984000, 0xA0987FFF},      //	PF3 S33
    {0xA0988000, 0xA098BFFF},      //	PF3 S34
    {0xA098C000, 0xA098FFFF},      //	PF3 S35
    {0xA0990000, 0xA0993FFF},      //	PF3 S36
    {0xA0994000, 0xA0997FFF},      //	PF3 S37
    {0xA0998000, 0xA099BFFF},      //	PF3 S38
    {0xA099C000, 0xA099FFFF},      //	PF3 S39
    {0xA09A0000, 0xA09A3FFF},      //	PF3 S40
    {0xA09A4000, 0xA09A7FFF},      //	PF3 S41
    {0xA09A8000, 0xA09ABFFF},      //	PF3 S42
    {0xA09AC000, 0xA09AFFFF},      //	PF3 S43
    {0xA09B0000, 0xA09B3FFF},      //	PF3 S44
    {0xA09B4000, 0xA09B7FFF},      //	PF3 S45
    {0xA09B8000, 0xA09BBFFF},      //	PF3 S46
    {0xA09BC000, 0xA09BFFFF},      //	PF3 S47
    {0xA09C0000, 0xA09C3FFF},      //	PF3 S48
    {0xA09C4000, 0xA09C7FFF},      //	PF3 S49
    {0xA09C8000, 0xA09CBFFF},      //	PF3 S50
    {0xA09CC000, 0xA09CFFFF},      //	PF3 S51
    {0xA09D0000, 0xA09D3FFF},      //	PF3 S52
    {0xA09D4000, 0xA09D7FFF},      //	PF3 S53
    {0xA09D8000, 0xA09DBFFF},      //	PF3 S54
    {0xA09DC000, 0xA09DFFFF},      //	PF3 S55
    {0xA09E0000, 0xA09E3FFF},      //	PF3 S56
    {0xA09E4000, 0xA09E7FFF},      //	PF3 S57
    {0xA09E8000, 0xA09EBFFF},      //	PF3 S58
    {0xA09EC000, 0xA09EFFFF},      //	PF3 S59
    {0xA09F0000, 0xA09F3FFF},      //	PF3 S60
    {0xA09F4000, 0xA09F7FFF},      //	PF3 S61
    {0xA09F8000, 0xA09FBFFF},      //	PF3 S62
    {0xA09FC000, 0xA09FFFFF},      //	PF3 S63
};

IFX_CONST IfxFlash_flashSector IfxFlash_pFlashTablePhys[IFXFLASH_PFLASH_NUM_PHYSICAL_SECTORS] = {
    {0xA0000000, 0xA00FFFFF},     /* PF0 PS0*/
    {0xA0100000, 0xA01FFFFF},     /* PF0 PS1*/
    {0xA0200000, 0xA02FFFFF},     /* PF0 PS2*/
    {0xA0300000, 0xA03FFFFF},     /* PF1 PS0*/
    {0xA0400000, 0xA04FFFFF},     /* PF1 PS1*/
    {0xA0500000, 0xA05FFFFF},     /* PF1 PS2*/
    {0xA0600000, 0xA06FFFFF},     /* PF2 PS0*/
    {0xA0700000, 0xA07FFFFF},     /* PF2 PS1*/
    {0xA0800000, 0xA08FFFFF},     /* PF2 PS2*/
    {0xA0900000, 0xA09FFFFF},     /* PF3 PS0*/
};
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
